grevaillot/svd_tools/headers/STM32H7A3x/bdma2.h
#pragma once 

/* --- BDMA2: BDMA1 ------------------------------------------------- */

/** @defgroup bdma2_registers BDMA1 Register
@{*/

/** BDMA2_ISR DMA interrupt status register **/
#define BDMA2_ISR			MMIO32(BDMA2_BASE + 0x00)
/** BDMA2_IFCR DMA interrupt flag clear register **/
#define BDMA2_IFCR			MMIO32(BDMA2_BASE + 0x04)
/** BDMA2_CCR0 DMA channel x configuration register **/
#define BDMA2_CCR0			MMIO32(BDMA2_BASE + 0x08)
/** BDMA2_CNDTR0 DMA channel x number of data register **/
#define BDMA2_CNDTR0			MMIO32(BDMA2_BASE + 0x0c)
/** BDMA2_CPAR0 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR0			MMIO32(BDMA2_BASE + 0x10)
/** BDMA2_CM0AR0 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR0			MMIO32(BDMA2_BASE + 0x14)
/** BDMA2_CM1AR0 This register must not be written when the channel is enabled **/
#define BDMA2_CM1AR0			MMIO32(BDMA2_BASE + 0x18)
/** BDMA2_CCR1 DMA channel x configuration register **/
#define BDMA2_CCR1			MMIO32(BDMA2_BASE + 0x1c)
/** BDMA2_CNDTR1 DMA channel x number of data register **/
#define BDMA2_CNDTR1			MMIO32(BDMA2_BASE + 0x20)
/** BDMA2_CPAR1 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR1			MMIO32(BDMA2_BASE + 0x24)
/** BDMA2_CM0AR1 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR1			MMIO32(BDMA2_BASE + 0x28)
/** BDMA2_CM1AR1 BDMA_CMAR1 **/
#define BDMA2_CM1AR1			MMIO32(BDMA2_BASE + 0x2c)
/** BDMA2_CCR2 DMA channel x configuration register **/
#define BDMA2_CCR2			MMIO32(BDMA2_BASE + 0x30)
/** BDMA2_CNDTR2 DMA channel x number of data register **/
#define BDMA2_CNDTR2			MMIO32(BDMA2_BASE + 0x34)
/** BDMA2_CPAR2 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR2			MMIO32(BDMA2_BASE + 0x38)
/** BDMA2_CM0AR2 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR2			MMIO32(BDMA2_BASE + 0x3c)
/** BDMA2_CM1AR2 BDMA_CM1AR2 **/
#define BDMA2_CM1AR2			MMIO32(BDMA2_BASE + 0x40)
/** BDMA2_CCR3 DMA channel x configuration register **/
#define BDMA2_CCR3			MMIO32(BDMA2_BASE + 0x44)
/** BDMA2_CNDTR3 DMA channel x number of data register **/
#define BDMA2_CNDTR3			MMIO32(BDMA2_BASE + 0x48)
/** BDMA2_CPAR3 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR3			MMIO32(BDMA2_BASE + 0x4c)
/** BDMA2_CM0AR3 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR3			MMIO32(BDMA2_BASE + 0x50)
/** BDMA2_CM1AR3 BDMA_CMAR3 **/
#define BDMA2_CM1AR3			MMIO32(BDMA2_BASE + 0x54)
/** BDMA2_CCR4 DMA channel x configuration register **/
#define BDMA2_CCR4			MMIO32(BDMA2_BASE + 0x58)
/** BDMA2_CNDTR4 DMA channel x number of data register **/
#define BDMA2_CNDTR4			MMIO32(BDMA2_BASE + 0x5c)
/** BDMA2_CPAR4 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR4			MMIO32(BDMA2_BASE + 0x60)
/** BDMA2_CM0AR4 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR4			MMIO32(BDMA2_BASE + 0x64)
/** BDMA2_CM1AR4 BDMA_CM1AR4 **/
#define BDMA2_CM1AR4			MMIO32(BDMA2_BASE + 0x68)
/** BDMA2_CCR5 DMA channel x configuration register **/
#define BDMA2_CCR5			MMIO32(BDMA2_BASE + 0x6c)
/** BDMA2_CNDTR5 DMA channel x number of data register **/
#define BDMA2_CNDTR5			MMIO32(BDMA2_BASE + 0x70)
/** BDMA2_CPAR5 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR5			MMIO32(BDMA2_BASE + 0x74)
/** BDMA2_CM0AR5 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR5			MMIO32(BDMA2_BASE + 0x78)
/** BDMA2_CM1AR5 This register must not be written when the channel is enabled. **/
#define BDMA2_CM1AR5			MMIO32(BDMA2_BASE + 0x7c)
/** BDMA2_CCR6 DMA channel x configuration register **/
#define BDMA2_CCR6			MMIO32(BDMA2_BASE + 0x80)
/** BDMA2_CNDTR6 DMA channel x number of data register **/
#define BDMA2_CNDTR6			MMIO32(BDMA2_BASE + 0x84)
/** BDMA2_CPAR6 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR6			MMIO32(BDMA2_BASE + 0x88)
/** BDMA2_CM0AR6 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR6			MMIO32(BDMA2_BASE + 0x8c)
/** BDMA2_CM1AR6 This register must not be written when the channel is enabled. **/
#define BDMA2_CM1AR6			MMIO32(BDMA2_BASE + 0x90)
/** BDMA2_CCR7 DMA channel x configuration register **/
#define BDMA2_CCR7			MMIO32(BDMA2_BASE + 0x94)
/** BDMA2_CNDTR7 DMA channel x number of data register **/
#define BDMA2_CNDTR7			MMIO32(BDMA2_BASE + 0x98)
/** BDMA2_CPAR7 This register must not be written when the channel is enabled. **/
#define BDMA2_CPAR7			MMIO32(BDMA2_BASE + 0x9c)
/** BDMA2_CM0AR7 This register must not be written when the channel is enabled. **/
#define BDMA2_CM0AR7			MMIO32(BDMA2_BASE + 0xa0)
/** BDMA2_CM1AR7 This register must not be written when the channel is enabled. **/
#define BDMA2_CM1AR7			MMIO32(BDMA2_BASE + 0xa4)

/**@}*/


/** @defgroup bdma2_isr ISR DMA interrupt status register
@{*/

/** BDMA2_ISR_TEIF8 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF8		(1 << 31)
/** BDMA2_ISR_HTIF8 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF8		(1 << 30)
/** BDMA2_ISR_TCIF8 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF8		(1 << 29)
/** BDMA2_ISR_GIF8 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF8		(1 << 28)
/** BDMA2_ISR_TEIF7 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF7		(1 << 27)
/** BDMA2_ISR_HTIF7 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF7		(1 << 26)
/** BDMA2_ISR_TCIF7 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF7		(1 << 25)
/** BDMA2_ISR_GIF7 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF7		(1 << 24)
/** BDMA2_ISR_TEIF6 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF6		(1 << 23)
/** BDMA2_ISR_HTIF6 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF6		(1 << 22)
/** BDMA2_ISR_TCIF6 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF6		(1 << 21)
/** BDMA2_ISR_GIF6 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF6		(1 << 20)
/** BDMA2_ISR_TEIF5 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF5		(1 << 19)
/** BDMA2_ISR_HTIF5 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF5		(1 << 18)
/** BDMA2_ISR_TCIF5 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF5		(1 << 17)
/** BDMA2_ISR_GIF5 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF5		(1 << 16)
/** BDMA2_ISR_TEIF4 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF4		(1 << 15)
/** BDMA2_ISR_HTIF4 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF4		(1 << 14)
/** BDMA2_ISR_TCIF4 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF4		(1 << 13)
/** BDMA2_ISR_GIF4 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF4		(1 << 12)
/** BDMA2_ISR_TEIF3 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF3		(1 << 11)
/** BDMA2_ISR_HTIF3 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF3		(1 << 10)
/** BDMA2_ISR_TCIF3 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF3		(1 << 9)
/** BDMA2_ISR_GIF3 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF3		(1 << 8)
/** BDMA2_ISR_TEIF2 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF2		(1 << 7)
/** BDMA2_ISR_HTIF2 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF2		(1 << 6)
/** BDMA2_ISR_TCIF2 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF2		(1 << 5)
/** BDMA2_ISR_GIF2 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF2		(1 << 4)
/** BDMA2_ISR_TEIF1 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TEIF1		(1 << 3)
/** BDMA2_ISR_HTIF1 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_HTIF1		(1 << 2)
/** BDMA2_ISR_TCIF1 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_TCIF1		(1 << 1)
/** BDMA2_ISR_GIF1 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA2_ISR_GIF1		(1 << 0)

/**@}*/

/** @defgroup bdma2_ifcr IFCR DMA interrupt flag clear register
@{*/

/** BDMA2_IFCR_CTEIF8 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF8		(1 << 31)
/** BDMA2_IFCR_CHTIF8 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF8		(1 << 30)
/** BDMA2_IFCR_CTCIF8 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF8		(1 << 29)
/** BDMA2_IFCR_CGIF8 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF8		(1 << 28)
/** BDMA2_IFCR_CTEIF7 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF7		(1 << 27)
/** BDMA2_IFCR_CHTIF7 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF7		(1 << 26)
/** BDMA2_IFCR_CTCIF7 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF7		(1 << 25)
/** BDMA2_IFCR_CGIF7 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF7		(1 << 24)
/** BDMA2_IFCR_CTEIF6 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF6		(1 << 23)
/** BDMA2_IFCR_CHTIF6 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF6		(1 << 22)
/** BDMA2_IFCR_CTCIF6 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF6		(1 << 21)
/** BDMA2_IFCR_CGIF6 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF6		(1 << 20)
/** BDMA2_IFCR_CTEIF5 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF5		(1 << 19)
/** BDMA2_IFCR_CHTIF5 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF5		(1 << 18)
/** BDMA2_IFCR_CTCIF5 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF5		(1 << 17)
/** BDMA2_IFCR_CGIF5 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF5		(1 << 16)
/** BDMA2_IFCR_CTEIF4 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF4		(1 << 15)
/** BDMA2_IFCR_CHTIF4 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF4		(1 << 14)
/** BDMA2_IFCR_CTCIF4 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF4		(1 << 13)
/** BDMA2_IFCR_CGIF4 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF4		(1 << 12)
/** BDMA2_IFCR_CTEIF3 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF3		(1 << 11)
/** BDMA2_IFCR_CHTIF3 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF3		(1 << 10)
/** BDMA2_IFCR_CTCIF3 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF3		(1 << 9)
/** BDMA2_IFCR_CGIF3 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF3		(1 << 8)
/** BDMA2_IFCR_CTEIF2 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF2		(1 << 7)
/** BDMA2_IFCR_CHTIF2 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF2		(1 << 6)
/** BDMA2_IFCR_CTCIF2 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF2		(1 << 5)
/** BDMA2_IFCR_CGIF2 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF2		(1 << 4)
/** BDMA2_IFCR_CTEIF1 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTEIF1		(1 << 3)
/** BDMA2_IFCR_CHTIF1 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CHTIF1		(1 << 2)
/** BDMA2_IFCR_CTCIF1 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CTCIF1		(1 << 1)
/** BDMA2_IFCR_CGIF1 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA2_IFCR_CGIF1		(1 << 0)

/**@}*/

/** @defgroup bdma2_ccr0 CCR0 DMA channel x configuration register
@{*/

/** BDMA2_CCR0_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA2_CCR0_MEM2MEM		(1 << 14)

