grevaillot/svd_tools/headers/STM32H7A3x/bdma2.h
#define BDMA2_CCR0_PL_SHIFT		12
#define BDMA2_CCR0_PL_MASK		0x03
/** @defgroup bdma2_ccr0_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA2_CCR0_MSIZE_SHIFT		10
#define BDMA2_CCR0_MSIZE_MASK		0x03
/** @defgroup bdma2_ccr0_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA2_CCR0_PSIZE_SHIFT		8
#define BDMA2_CCR0_PSIZE_MASK		0x03
/** @defgroup bdma2_ccr0_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA2_CCR0_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA2_CCR0_MINC		(1 << 7)
/** BDMA2_CCR0_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA2_CCR0_PINC		(1 << 6)
/** BDMA2_CCR0_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA2_CCR0_CIRC		(1 << 5)
/** BDMA2_CCR0_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA2_CCR0_DIR		(1 << 4)
/** BDMA2_CCR0_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA2_CCR0_TEIE		(1 << 3)
/** BDMA2_CCR0_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA2_CCR0_HTIE		(1 << 2)
/** BDMA2_CCR0_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA2_CCR0_TCIE		(1 << 1)
/** BDMA2_CCR0_EN Channel enable This bit is set and cleared by software. **/
#define BDMA2_CCR0_EN		(1 << 0)

/**@}*/

/** @defgroup bdma2_cndtr0 CNDTR0 DMA channel x number of data register
@{*/


#define BDMA2_CNDTR0_NDT_SHIFT		0
#define BDMA2_CNDTR0_NDT_MASK		0xffff
/** @defgroup bdma2_cndtr0_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma2_cpar0 CPAR0 This register must not be written when the channel is enabled.
@{*/


#define BDMA2_CPAR0_PA_SHIFT		0
#define BDMA2_CPAR0_PA_MASK		0xffffffff
/** @defgroup bdma2_cpar0_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma2_cm0ar0 CM0AR0 This register must not be written when the channel is enabled.
@{*/


#define BDMA2_CM0AR0_MA_SHIFT		0
#define BDMA2_CM0AR0_MA_MASK		0xffffffff
/** @defgroup bdma2_cm0ar0_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma2_cm1ar0 CM1AR0 This register must not be written when the channel is enabled
@{*/


/**@}*/

/** @defgroup bdma2_ccr1 CCR1 DMA channel x configuration register
@{*/

/** BDMA2_CCR1_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA2_CCR1_MEM2MEM		(1 << 14)

#define BDMA2_CCR1_PL_SHIFT		12
#define BDMA2_CCR1_PL_MASK		0x03
/** @defgroup bdma2_ccr1_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA2_CCR1_MSIZE_SHIFT		10
#define BDMA2_CCR1_MSIZE_MASK		0x03
/** @defgroup bdma2_ccr1_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA2_CCR1_PSIZE_SHIFT		8
#define BDMA2_CCR1_PSIZE_MASK		0x03
/** @defgroup bdma2_ccr1_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA2_CCR1_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA2_CCR1_MINC		(1 << 7)
/** BDMA2_CCR1_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA2_CCR1_PINC		(1 << 6)
/** BDMA2_CCR1_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA2_CCR1_CIRC		(1 << 5)
/** BDMA2_CCR1_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA2_CCR1_DIR		(1 << 4)
/** BDMA2_CCR1_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA2_CCR1_TEIE		(1 << 3)
/** BDMA2_CCR1_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA2_CCR1_HTIE		(1 << 2)
/** BDMA2_CCR1_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA2_CCR1_TCIE		(1 << 1)
/** BDMA2_CCR1_EN Channel enable This bit is set and cleared by software. **/
#define BDMA2_CCR1_EN		(1 << 0)

/**@}*/

/** @defgroup bdma2_cndtr1 CNDTR1 DMA channel x number of data register
@{*/


#define BDMA2_CNDTR1_NDT_SHIFT		0
#define BDMA2_CNDTR1_NDT_MASK		0xffff
/** @defgroup bdma2_cndtr1_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma2_cpar1 CPAR1 This register must not be written when the channel is enabled.
@{*/


